from main.models import Region, City

data = {
    "Баткенская": ["Айдаркен", "Баткен", "Исфана", "Кадамжай", "Кызыл-Кия", "Сулюкта"],
    "Джалал-Абадская": [
        "Базар-Коргон",
        "Джалал-Абад",
        "Кара-Куль",
        "Кербен",
        "Кок-Джангак",
        "Кочкор-Ата",
        "Майлуу-Суу",
        "Таш-Кумыр",
        "Токтогул",
    ],
    "Иссык-Кульская": ["Балыкчы", "Каракол", "Чолпон-Ата"],
    "Нарынская": ["Ат-Баши", "Баетов", "Нарын"],
    "Ошская": ["Кара-Суу", "Ноокат", "Узген"],
    "Таласская": ["Кызыл-Адыр", "Талас"],
    "Чуйская": ["Кант", "Кара-Балта", "Орловка", "Токмок", "Шопоков"],
}

for i in data:
    city = City.objects.create(name=i)
    for j in data[i]:
        region = Region.objects.create(name=j, cite=city)
